//
//  NearestSpots.swift
//  Layout_MIG
//
//  Created by Meerim Dzhetybaeva on 19/8/22.
//

import SwiftUI

struct SpotsRow: View {
    
//    var spot: [String: String]
    var spotName: String
    var address: String
    
    var body: some View {
        VStack(alignment: .leading, spacing: 7) {
                Text("\(spotName)")
                    .font(.system(size: 20, weight: .bold, design: .rounded))
                    .foregroundColor(.blue)
            HStack(spacing: 10) {
                    Button(action: {
                        print("Tapped")
                    }) {
                        Image(systemName: "phone")
                    } .padding(.leading, 280)
                    Button(action: {
                        print("Tapped")
                    }) {
                        Image(systemName: "phone")
                    }
                }
                VStack {
                    Text("\(address)")
                }
        } .frame(width: 310, height: .infinity)
    }
}

struct NearestSpots: View {
//    @State private var addresses: [String: String] = [
//        "МиГ 1": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 2": "пр. Достык, 40, уг. ул.Кабанбай баатыра",
//        "МиГ 3": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 4": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 5": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 6": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 7": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 8": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 9": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 10": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 11": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 12": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 13": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 14": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 15": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 16": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 17": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 18": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 19": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 20": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 21": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 22": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 23": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 24": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 25": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 26": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 27": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 28": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 29": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 30": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 31": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 32": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 33": "ул. Желтоксан, 88, ниже ул.Гоголя",
//        "МиГ 34": "ул. Желтоксан, 88, ниже ул.Гоголя"
//        ]
    
    @State private var spotNames = ["МиГ 1", "МиГ 2", "МиГ 3", "МиГ 5"]
    
//                                    , "МиГ 6", "МиГ 7", "МиГ 8", "МиГ 9", "МиГ 10", "МиГ 11", "МиГ 12", "МиГ 13", "МиГ 14", "МиГ 15", "МиГ 16", "МиГ 17", "МиГ 18", "МиГ 19", "МиГ 20", "МиГ 21", "МиГ 22", "МиГ 23", "МиГ 24", "МиГ 25", "МиГ 26", "МиГ 27", "МиГ 28", "МиГ 29", "МиГ 30", "МиГ 31", "МиГ 32", "МиГ 33", "МиГ 34"]
    
        @State private var addresses = ["ул. Желтоксан, 88, ниже ул.Гоголя", "пр. Достык, 40, уг. ул.Кабанбай баатыра", "пр. Райымбека, 100, уг. пр.Назарбаева", "ул. Ауэзова, 140 ниже ул. Тимирязева"]
    
    var body: some View {
        VStack {
            HStack {
                Text("Ближайшие пункты")
                    .font(.system(size: 19, weight: .bold, design: .default))
                Button(action: {
                    //
                }) {
                    Image(systemName: "heart")
                }
            }
            List {
                ForEach(0..<addresses.count) {
                    SpotsRow(spotName: "\(self.spotNames[$0])", address: "\(self.addresses[$0])")
                } .listRowBackground(Color.white)
                    .listSectionSeparator(.visible)
            } .listStyle(PlainListStyle())
        }
    }
}

struct NearestSpots_Previews: PreviewProvider {
    static var previews: some View {
        NearestSpots()
    }
}
